cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask "java"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "vagrant"
cask "spotify"
cask "whatsapp"
cask "spotify", args: { appdir: "/Applications" }
cask "1password"

# user-prefs

# Native-dev
cask "android-studio", args: { appdir: "/Applications" }
cask "react-native-debugger"
cask "cocoapods" # may not be arm64 compatible


# dev formulae
brew "httpie"
brew "neovim"
brew "watchman"

# dev casks
# cask "postico"
cask "discord"
cask "postman", args: { appdir: "/Applications" }
cask "stats", args: { appdir: "/Applications" }
cask "wireshark"

# System
brew "zsh-completions"
brew "mas"
brew "curl"
brew "wget"
brew "vim"
brew "openssl"
brew "coreutils" # (could interfere with c++ package compilation when using arm64 based mac)
brew "moreutils"
brew "findutils"
brew "binutils"
brew "rename"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "grep"
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "screen"
brew "gmp"
brew "nmap"
brew "socat"
brew "rlwrap"
brew "dnstracer"
brew "sslscan"

# Git
brew "git"
brew "git-lfs"
brew "gh"
brew "tig"
cask "sourcetree", args: { appdir: "/Applications" }

# Ops
brew "docker"
brew "docker-compose"
brew "awscli"

# Images, Audio, Video
brew "imagemagick"
brew "gifsicle"
brew "gifify"
brew "ffmpeg"

# Archive & Git
brew "xz"
brew "p7zip"

# Extract rpm file content with rpm2cpio *.rpm | cpio -ivd
# brew "rpm2cpio"

# JSON
brew "jq"
brew "jo"

# Dev
brew "python@3.9"
brew "ruby"
brew "yarn"
brew "rbenv"
brew "python"
brew "go"
brew "cmake"
brew "openjdk"
brew "kind"
brew "deno"

# RN dev
cask "react-native-debugger", args: { appdir: "/Applications" }
cask "zeplin"

cask "raspberry-pi-imager"

# App Store
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
mas "Disk Space Analyzer Free", id: 446243721

# Necessary apple bloatware :P
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Deps
brew "glib"
brew "openldap"
brew "guile"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "ldns"
brew "libfido2"
brew "perl"
brew "ruby-build"

# Uncategorised
brew "wimlib"
cask "sketch"
