cask_args appdir: "/Applications"

# Tap Homebrew
tap "buildpacks/tap"
tap "env0/terratag"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"

cask "visual-studio-code", args: { appdir: "/Applications" }
# cask "firefox", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
# cask "vagrant"
cask "spotify"
cask "whatsapp"
# cask "1password"

# user-prefs

# Native-dev
# cask "android-studio", args: { appdir: "/Applications" }
# cask "react-native-debugger"
# cask "cocoapods" # may not be arm64 compatible


# dev formulae
brew "httpie"
brew "neovim"
brew "watchman"

# dev casks
cask "stats", args: { appdir: "/Applications" }
cask "wireshark"

# System
brew "zsh-completions"
brew "mas"
brew "curl"
brew "wget"
brew "vim"
brew "openssl"
brew "coreutils" # (could interfere with c++ package compilation when using arm64 based mac)
brew "moreutils"
brew "findutils"
brew "binutils"
brew "rename"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "grep"
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "screen"
brew "gmp"
brew "nmap"
brew "socat"
brew "rlwrap"
brew "dnstracer"
brew "sslscan"

# Git
brew "git"
brew "git-lfs"
brew "gh"
brew "tig"
cask "sourcetree", args: { appdir: "/Applications" }

# Ops
brew "docker"
brew "docker-compose"
# brew "awscli"

# Shell
cask "amazon-q"

# Images, Audio, Video
brew "imagemagick"
brew "gifsicle"
brew "gifify"
brew "ffmpeg"

# Archive & Git
brew "xz"
brew "p7zip"

# Extract rpm file content with rpm2cpio *.rpm | cpio -ivd
# brew "rpm2cpio"

# JSON
brew "jq"
brew "jo"

# DB
cask "dynobase"

# Dev
brew "ruby"
brew "yarn"
brew "rbenv"
brew "go"
brew "cmake"
brew "openjdk"
brew "kind"

# 133t H4x
brew "mitmproxy"


# RN dev
cask "react-native-debugger", args: { appdir: "/Applications" }
brew "folly" # Natively supported debugger
cask "raspberry-pi-imager"

# Miscellaneous
# brew "wimlib" # For formatting windows recovery USBs


# App Store
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
# mas "Xcode", id: 497799835

# Necessary apple bloatware :P
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Deps
brew "glib"
brew "openldap"
brew "guile"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "ldns"
brew "libfido2"
brew "perl"
brew "ruby-build"

# Uncategorised
brew "cloc"
brew "fizz"
brew "wangle"

brew "sqlite"
brew "checkov"
brew "coreutils"
brew "folly"
brew "fastjar"
brew "fbthrift"
brew "fb303"
brew "srt"
brew "libheif"
brew "hugo"
brew "kubectx"
brew "mtr"
brew "openssl@3"
brew "pre-commit"
brew "subversion"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "env0/terratag/terratag"
tap "mach-composer/mach-composer"
tap "messense/macos-cross-toolchains"
tap "microsoft/mssql-release"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "ansible"
brew "ansible-lint"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "argocd"
brew "arm-linux-gnueabihf-binutils"
brew "arp-scan"
brew "avro-tools"
brew "berkeley-db"
brew "blueutil"
brew "boost"
brew "openblas"
brew "python-markdown", link: false
brew "libssh2"
brew "rtmpdump"
brew "libevent"
brew "edencommon"
brew "exiftool"
brew "unbound"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "freetds"
brew "ghostscript"
brew "libraw"
brew "git-svn"
brew "helm"
brew "inetutils"
brew "iperf"
brew "iperf3"
brew "istioctl"
brew "kustomize"
brew "protobuf"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mysql"
brew "openjdk@11"
brew "openapi-generator"
brew "virtualenv"
brew "ripgrep"
brew "sqlcmd", link: false
brew "tcl-tk"
brew "thefuck"
brew "watch"
brew "yq"
brew "zbar"
brew "buildpacks/tap/pack"


cask "android-platform-tools"
cask "cyberduck"
cask "gimp"
cask "stremio"
cask "vnc-viewer"
cask "zoom"
cask "dynobase", args: { appdir: "/Applications" }
cask "fig", args: { appdir: "/Applications" }
cask "raspberry-pi-imager", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }


mas "Dashlane", id: 517914548
mas "Todoist", id: 585829637
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "‎WhatsApp", id: 310633997
mas "TickTick", id: 966085870

brew "asdf"
brew "deno"
brew "dhcpdump"
brew "dhcping"
brew "jackett", restart_service: :changed
brew "ollama"
brew "openvpn"
brew "samba"
brew "skaffold"
cask "android-platform-tools", args: { appdir: "/Applications" }
cask "bruno"
cask "cyberduck", args: { appdir: "/Applications" }
cask "gimp", args: { appdir: "/Applications" }
cask "hex-fiend"
cask "openvpn-connect"
cask "qbittorrent"
cask "stremio", args: { appdir: "/Applications" }
cask "vnc-viewer", args: { appdir: "/Applications" }
cask "whatsapp", args: { appdir: "/Applications" }
cask "wireshark", args: { appdir: "/Applications" }
cask "zap"
cask "zoom", args: { appdir: "/Applications" }
mas "WhatsApp", id: 310633997
tap "openclaw/tap"
tap "robusta-dev/krr"
tap "steipete/tap"
tap "teamookla/speedtest"
# C parser in Python
# C Foreign Function Interface for Python
# Cryptography and SSL/TLS Toolkit
# Cryptographic recipes and primitives for Python
# General-purpose data compression with high compression ratio
# Automate deployment, configuration, and upgrading
# Checks ansible playbooks for practices and behaviour
# New file format for still image compression
# Codec library for encoding and decoding AV1 video streams
# Companion library to apr, the Apache Portable Runtime library
# GitOps Continuous Delivery for Kubernetes
# FSF/GNU binutils for cross-compiling to arm-linux
# ARP scanning and fingerprinting tool
# Extendable version manager with support for Ruby, Node.js, Erlang & more
# Core application library for C
# OpenType text shaping engine
# Development kit for the Java programming language
# Avro command-line tools and utilities
# High performance key/value database
# GNU binary tools for native development
# Get/set bluetooth power and discoverable state
# Collection of portable C++ source libraries
# GNU multiple precision arithmetic library
# Prevent cloud misconfigurations during build-time for IaC tools
# Statistics utility to count lines of code
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
# GNU File, Shell, and Text utilities
# C library implementing the SSH2 protocol
# Tool for downloading RTMP streaming media
# Get a file from an HTTP, HTTPS or FTP server
# Secure runtime for JavaScript and TypeScript
# Monitor DHCP traffic for debugging purposes
# Perform a dhcp-request to check whether a dhcp-server is running
# Trace a chain of DNS servers to the source
# Pack, ship and run any application as a lightweight container
# Isolated development environments using Docker
# Asynchronous event library
# Collection of reusable C++ library artifacts developed at Facebook
# C++14 implementation of the TLS-1.3 standard
# Modular, composable client/server abstractions framework
# Facebook's branch of Apache Thrift, including a new C++ server
# Thrift functions for querying information from a service
# Shared library for Watchman and Eden projects
# Perl lib for reading and writing EXIF metadata
# Implementation of Sun's jar tool
# Play, record, convert, and stream select audio and video codecs
# Collection of GNU find, xargs, and locate
# Libraries to talk to Microsoft SQL Server and Sybase databases
# GNU awk utility
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
# Framework for layout and rendering of i18n text
# OCR (Optical Character Recognition) engine
# Interpreter for PostScript and PDF
# Validating, recursive, caching DNS resolver
# GNU Transport Layer Security (TLS) Library
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
# Library for reading RAW files from digital photo cameras
# Tools and libraries to manipulate images in select formats
# Subtitle renderer for the ASS/SSA subtitle format
# Light HTTP/1.1 server library
# Reliable Internet Stream Transport (RIST)
# Secure Reliable Transport
# Turn movies into GIFs
# GIF image/animation creator/editor
# Distributed revision control system
# Git extension for versioning large files
# Version control system designed to be a better CVS
# Bidirectional operation between a Subversion repository and Git
# Command-line option parsing utility
# C code prettifier
# GNU implementation of the famous stream editor
# GNU version of the tar archiving utility
# Open source programming language to build simple/reliable/efficient software
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
# Google Suite CLI
brew "gogcli"
# GNU grep, egrep and fgrep
# GNU Ubiquitous Intelligent Language for Extensions
# Kubernetes package manager
# CLI email client written in Rust
brew "himalaya"
# Improved top (interactive process viewer)
# User-friendly cURL replacement (command-line HTTP client)
# Configurable static site generator
# GNU utilities for networking
# Tool to measure maximum TCP and UDP bandwidth
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
# Istio configuration command-line utility
# API Support for your favorite torrent trackers
# JSON output from a shell
# Lightweight and flexible command-line JSON processor
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
# Tool that can switch between kubectl contexts easily and create aliases
# Template-free customization of Kubernetes YAML manifests
# DNS library written in C
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
# Mac App Store command-line interface
# Modern and intuitive terminal-based text editor
brew "micro"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
# Atlas CLI enables you to manage your MongoDB Atlas
# Collection of tools that nobody wrote when UNIX was young
# 'traceroute' and 'ping' in a single tool
# Protocol buffers (Google's data interchange format)
# Open source relational database management system
# Ambitious Vim-fork focused on extensibility and agility
# Port scanning utility for large networks
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
# Open source suite of directory software
# OpenBSD freely-licensed SSH connectivity tools
# 7-Zip (high compression file archiver) implementation
# Highly capable, feature-rich programming language
# Display the PID number for a given process name
# Framework for managing multi-language pre-commit hooks
# Show ps output as a tree
# Python implementation of Markdown
# Tool Command Language
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Install various Ruby versions and implementations
# Ruby version manager
# Perl-powered file rename script with many helpful built-ins
# Search tool like grep and The Silver Searcher
# Readline wrapper: adds readline support to tools that lack it
# Utility that provides fast incremental file transfer
# SMB/CIFS file, print, and login server for UNIX
# Terminal multiplexer with VT100/ANSI terminal emulation
# Easy and Repeatable Kubernetes Development
# SOcket CAT: netcat on steroids
# Microsoft SQL Server command-line interface
# Add a public key to a remote machine's authorized_keys file
# Test SSL/TLS enabled services to discover supported cipher suites
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Tool to generate documentation from Terraform modules
# Linter for Terraform files
# Static analysis security scanner for your terraform code
# Programmatically correct mistyped console commands
# Text interface for Git repositories
# Display directories as trees (with optional color/HTML output)
# Vi 'workalike' with many additional features
# Tool for creating isolated virtual python environments
# Executes a program periodically, showing output fullscreen
# Watch files and take action when they change
# Internet file retriever
# JavaScript package manager
# Process YAML, JSON, XML, CSV and properties documents from the CLI
# Suite of barcodes-reading tools
# Additional completion definitions for zsh
# Android SDK component
# Tools for building Android applications
cask "android-studio"
# Open source IDE for exploring and testing APIs
# Anthropic's official Claude AI desktop app
cask "claude"
# Server and cloud storage browser
# Voice and text chat software
# GUI Client for DynamoDB
# Reimagine your terminal
# Free and open-source image editor
# Hex editor focussing on speed
# Personal AI assistant
cask "openclaw"
# Client program for the OpenVPN Access Server
# Replacement for Docker Desktop
cask "orbstack"
# Peer to peer Bitorrent client
# Imaging utility to install operating systems to a microSD card
# Standalone app for debugging React Native apps
# Graphical client for Git version control
# Music streaming service
# System monitor for the menu bar
# Open-source media center
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
# Multimedia player
# Remote desktop application focusing on security
# Native desktop client for WhatsApp
# Network protocol analyzer
cask "wireshark-app", args: { appdir: "/Applications" }
# Free and open source web app scanner
# Video communication and virtual meeting platform
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "apertia.vscode-aider"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "clarkyu.vscode-sql-beautify"
vscode "continue.continue"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "huggingface.huggingface-vscode"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mattiasbaake.vscode-snippets-for-ansible"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "teabyii.ayu"
vscode "tim-koehler.helm-intellisense"
vscode "tonybaloney.vscode-pets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "withfig.fig"
